# Dataset 1: Synthetic Circle

## Introduction

## Exploratory Data Analysis (EDA)

In [5]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [7]:
df = pd.read_csv("circles.txt")

### Reading and Data Preprocessing

We will take a look at the structure of the data.

In [10]:
df.head()

           x          y  class
0    3.15676  116.12252      6
1   16.14436   16.81660     11
2  100.31212   64.99025     53
3   -1.33773   84.81772      4
4  104.37328   62.42373     53

In [14]:
df.tail()

              x          y  class
9995   -4.85337  138.79801      7
9996  135.75636   77.35585     74
9997   81.18879  184.85662     49
9998  116.47674  116.45223     66
9999  120.84808   75.07245     64

In [17]:
df.shape

(10000, 3)

In [24]:
df.isnull().sum()

x        0
y        0
class    0
dtype: int64

In [26]:
df.dtypes

x        float64
y        float64
class      int64
dtype: object

So we upon looking at the data, we see that there are no missing values and all values are of the float type.